export default {
  // 1-100
  cacheTimeNumber: /^\d{1,}$/,
  dnsDomain: /^(\*\.[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?\.)|([a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?\.)+[a-zA-Z]{2,6}$/i,
  // 有协议的url,以 http | https 开头
  defaultUrl: /^((http|https):\/\/)(.*)/i,
  httpUrl: /^((http):\/\/)(.*)/i,
  // 没有协议的url,以 / 开头
  noProtocolUrl: /^(\/)(.*)/i,
  // 协议可有可无的url:
  haveHttpOrNotUrl: /^(((http|https):\/)?\/)(.*)/i,
  // 中文、字母、数字以及下划线
  regChFig: /^[a-zA-Z0-9\u4e00-\u9fa5_]+$/,
  // '/'开头
  slashBegin: /^(\/).*$/,
  // invoice
  // name 20个字节，允许输入汉字、数字、英文字母
  name: /^[a-zA-Z0-9\u4e00-\u9fa5]{1,20}$/,
  // 密钥格式
  key: /^[a-zA-Z0-9]{6,20}$/,
  // 带有号段验证的11位手机号
  strictMobile: /^1[3|4|5|6|7|8|9][0-9]{9}$/,
  // mobile
  mobile: /^\d{11,18}$/,
  // telephone
  tel: /^\d{7,18}$/,
  // adress 100个字节，允许输入汉字、数字、英文字母、符号
  address: /^\S{1,100}$/,
  // bank_name 80个字节，允许输入汉字、数字、英文字母
  bankName: /^[a-zA-Z0-9\u4e00-\u9fa5]{1,80}$/,
  // bank_account 公司开户行账号 只校验了位数
  bankAccount: /^\d{1,25}$/,
  // IPV4验证：
  Ipv4Reg: /^((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$/,
  // qq验证
  qq: /^[0-9]{5,12}$/,
  // 组织机构代码9位验证
  organizationCode: /^[a-zA-Z0-9]{9}$/,
  // 组织机构代码18位验证
  organizationCode18: /^[a-zA-Z0-9]{18}$/,
  // 验证非零正整数
  plusnum: /^\+?[1-9][0-9]*$/,
  // ip区域段
  ipRangeReg: /^(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])-(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])$/,
  // IP格式验证
  ipReg: /^(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])$/,
  // cidr
  cidrREG: /^(((\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5]))(\/([0-9]|1[0-9]|2[0-9]|3[0-2]))?(\r|\n|\r\n)?){1,4}$/
}
